Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFace.Holes Property
 Gets the holes.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<FacetedBrepFaceHole> Holes { get; }
Public ReadOnly Property Holes As IList(Of FacetedBrepFaceHole)
	Get
Property Value
Type: IList<FacetedBrepFaceHole>
See Also
Reference
FacetedBrepFace Class
Tekla.Structures.Geometry3d Namespace